<a href="https://colab.research.google.com/github/JakeOh/202007_itw_bd18/blob/master/lab_python/python52_merge.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**데이터 프레임 합치기**
* merge/join: 두 개의 데이터 프레임을 공통된 컬럼을 기준으로 합치는 것.
* concat: 데이터 프레임의 축(axis)을 따라서 합치는 것.

In [1]:
import numpy as np
import pandas as pd

In [2]:
df1 = pd.DataFrame({'key': ['a', 'a', 'b', 'b', 'a', 'c'],
                    'data1': range(6)})
df1

  key  data1
0   a      0
1   a      1
2   b      2
3   b      3
4   a      4
5   c      5

In [3]:
df2 = pd.DataFrame({'key': ['a', 'c', 'd'],
                    'data2': [10, 20, 30]})
df2

  key  data2
0   a     10
1   c     20
2   d     30

pandas.merge() 함수

In [8]:
m1 = pd.merge(left=df1, right=df2, on='key')  # how='inner' 기본값
m1

  key  data1  data2
0   a      0     10
1   a      1     10
2   a      4     10
3   c      5     20

pandas.DataFrame.merge() 메서드

In [9]:
m2 = df1.merge(df2, on='key')
m2

  key  data1  data2
0   a      0     10
1   a      1     10
2   a      4     10
3   c      5     20

In [11]:
# left join
m3 = pd.merge(left=df1, right=df2, how='left', on='key')
m3

  key  data1  data2
0   a      0   10.0
1   a      1   10.0
2   b      2    NaN
3   b      3    NaN
4   a      4   10.0
5   c      5   20.0

In [12]:
m4 = df1.merge(df2, how='left', on='key')
m4

  key  data1  data2
0   a      0   10.0
1   a      1   10.0
2   b      2    NaN
3   b      3    NaN
4   a      4   10.0
5   c      5   20.0

In [13]:
m5 = pd.merge(left=df1, right=df2, how='right', on='key')
m5

  key  data1  data2
0   a    0.0     10
1   a    1.0     10
2   a    4.0     10
3   c    5.0     20
4   d    NaN     30

In [14]:
m6 = pd.merge(left=df1, right=df2, how='outer', on='key')
m6

  key  data1  data2
0   a    0.0   10.0
1   a    1.0   10.0
2   a    4.0   10.0
3   b    2.0    NaN
4   b    3.0    NaN
5   c    5.0   20.0
6   d    NaN   30.0

pandas.merge() 함수의 Parameter들:
* left, right: merge/join할 데이터 프레임.
* how: merge/join 방법. inner(기본값), left, right, outer
* on: 데이터 프레임을 merge/join하는 기준이 되는 컬럼(들). 두 데이터 프레임이 같은 이름의 컬럼을 갖고 있는 경우.
* left_on, right_on: merge/join 기준이 되는 컬럼이 두 데이터 프레임에서 다른 이름일 때.
* left_index, right_index: 인덱스로 merge/join를 할 때. True/False(기본값).

In [15]:
employees = pd.DataFrame({'empno': [1001, 1002, 1003, 1101, 1102],
                          'deptno': [10, 10, 20, 30, np.nan]})
employees

   empno  deptno
0   1001    10.0
1   1002    10.0
2   1003    20.0
3   1101    30.0
4   1102     NaN

In [16]:
departments = pd.DataFrame({'dno': [10, 20, 30, 40],
                            'dname': ['Sales', 'HR', 'Accounting', 'Research']})
departments

   dno       dname
0   10       Sales
1   20          HR
2   30  Accounting
3   40    Research

In [17]:
emp_dept = pd.merge(left=employees, right=departments,
                    how='inner',
                    left_on='deptno', right_on='dno')
emp_dept

   empno  deptno  dno       dname
0   1001    10.0   10       Sales
1   1002    10.0   10       Sales
2   1003    20.0   20          HR
3   1101    30.0   30  Accounting

inner / left / right / outer join을 비교

In [20]:
employees.merge(departments, how='outer',
                left_on='deptno', right_on='dno')
# pd.merge(left=employees, right=departments, how='outer',
#          left_on='deptno', right_on='dno')

    empno  deptno   dno       dname
0  1001.0    10.0  10.0       Sales
1  1002.0    10.0  10.0       Sales
2  1003.0    20.0  20.0          HR
3  1101.0    30.0  30.0  Accounting
4  1102.0     NaN   NaN         NaN
5     NaN     NaN  40.0    Research

In [21]:
df3 = pd.DataFrame(data={'data1': range(6)},
                   index=['a', 'b', 'c'] * 2)
df3  # (6, 1) shape

   data1
a      0
b      1
c      2
a      3
b      4
c      5

In [22]:
df4 = pd.DataFrame(data={'data2': [11, 22, 33, 44]}, 
                   index=['a', 'b', 'c', 'd'])
df4  # (4, 1) shape

   data2
a     11
b     22
c     33
d     44

인덱스를 사용해서 merge/join

In [27]:
pd.merge(left=df3, right=df4, how='outer',
         left_index=True, right_index=True)
# how 값을 바꿔가면서 테스트.

   data1  data2
a    0.0     11
a    3.0     11
b    1.0     22
b    4.0     22
c    2.0     33
c    5.0     33
d    NaN     44

In [28]:
df5 = pd.DataFrame(data={'key': ['a', 'b', 'c'] * 2,
                         'data1': range(6)})
df5  # (6, 2) shape

  key  data1
0   a      0
1   b      1
2   c      2
3   a      3
4   b      4
5   c      5

In [30]:
pd.merge(left=df5, right=df4, how='inner',
         left_on='key', right_index=True)

  key  data1  data2
0   a      0     11
1   b      1     22
2   c      2     33
3   a      3     11
4   b      4     22
5   c      5     33

https://github.com/wesm/pydata-book/tree/2nd-edition/datasets/movielens 
폴더에는 movies.dat, ratings.data, users.data 세 개의 데이터 파일이 있습니다.
1. movies, ratings, users 데이터 프레임을 생성 - 컬럼 이름 설정
2. ratings, movies 데이터 프레임을 merge: inner, left 비교
3. 2에서 생성된 데이터 프레임과 users 데이터 프레임 merge: inner, left 비교

(주의)
* 모든 데이터 파일은 '::'으로 값들이 구분되어 있습니다.
* 모든 데이터 파일은 헤더 정보가 없습니다.
* encoding 에러가 발생하는 경우 'cp1252'를 시도해 보세요.

In [32]:
# 데이터 파일 경로
movies_data = 'https://raw.githubusercontent.com/wesm/pydata-book/2nd-edition/datasets/movielens/movies.dat'
ratings_data = 'https://raw.githubusercontent.com/wesm/pydata-book/2nd-edition/datasets/movielens/ratings.dat'
users_data = 'https://raw.githubusercontent.com/wesm/pydata-book/2nd-edition/datasets/movielens/users.dat'

# 데이터 프레임 컬럼 이름
movies_col_names = ['movie_id', 'title', 'genres']
ratings_col_names = ['user_id', 'movie_id', 'rating', 'timestamp']
users_col_names = ['user_id', 'gender', 'age', 'occupation', 'zip_code']

In [35]:
movies = pd.read_csv(movies_data, sep='::', encoding='cp1252',
                     header=None, names=movies_col_names)
movies

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

      movie_id  ...                        genres
0            1  ...   Animation|Children's|Comedy
1            2  ...  Adventure|Children's|Fantasy
2            3  ...                Comedy|Romance
3            4  ...                  Comedy|Drama
4            5  ...                        Comedy
...        ...  ...                           ...
3878      3948  ...                        Comedy
3879      3949  ...                         Drama
3880      3950  ...                         Drama
3881      3951  ...                         Drama
3882      3952  ...                Drama|Thriller

[3883 rows x 3 columns]

In [36]:
ratings = pd.read_csv(ratings_data, sep='::', encoding='cp1252',
                      header=None, names=ratings_col_names)
ratings

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

         user_id  movie_id  rating  timestamp
0              1      1193       5  978300760
1              1       661       3  978302109
2              1       914       3  978301968
3              1      3408       4  978300275
4              1      2355       5  978824291
...          ...       ...     ...        ...
1000204     6040      1091       1  956716541
1000205     6040      1094       5  956704887
1000206     6040       562       5  956704746
1000207     6040      1096       4  956715648
1000208     6040      1097       4  956715569

[1000209 rows x 4 columns]

In [37]:
users = pd.read_csv(users_data, sep='::', encoding='cp1252',
                    header=None, names=users_col_names)
users

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

      user_id gender  age  occupation zip_code
0           1      F    1          10    48067
1           2      M   56          16    70072
2           3      M   25          15    55117
3           4      M   45           7    02460
4           5      M   25          20    55455
...       ...    ...  ...         ...      ...
6035     6036      F   25          15    32603
6036     6037      F   45           1    76006
6037     6038      F   56           1    14706
6038     6039      F   45           0    01060
6039     6040      M   25           6    11106

[6040 rows x 5 columns]

In [40]:
ratings_movies = pd.merge(left=ratings, right=movies,
                          how='inner', on='movie_id')
ratings_movies
# how의 값을 바꿨을 때 결과 데이터 프레임 shape을 비교.

         user_id  ...                genres
0              1  ...                 Drama
1              2  ...                 Drama
2             12  ...                 Drama
3             15  ...                 Drama
4             17  ...                 Drama
...          ...  ...                   ...
1000204     5949  ...           Documentary
1000205     5675  ...                 Drama
1000206     5780  ...                 Drama
1000207     5851  ...  Comedy|Drama|Western
1000208     5938  ...           Documentary

[1000209 rows x 6 columns]

In [41]:
result_df = pd.merge(left=ratings_movies, right=users,
                     how='inner', on='user_id')
result_df

         user_id  movie_id  rating  timestamp  ... gender age occupation  zip_code
0              1      1193       5  978300760  ...      F   1         10     48067
1              1       661       3  978302109  ...      F   1         10     48067
2              1       914       3  978301968  ...      F   1         10     48067
3              1      3408       4  978300275  ...      F   1         10     48067
4              1      2355       5  978824291  ...      F   1         10     48067
...          ...       ...     ...        ...  ...    ...  ..        ...       ...
1000204     4211      3791       2  965319075  ...      M  45          5     77662
1000205     4211      3806       3  965319138  ...      M  45          5     77662
1000206     4211      3840       4  965319197  ...      M  45          5     77662
1000207     4211      3766       2  965319138  ...      M  45          5     77662
1000208     4211      3834       2  965318885  ...      M  45          5     77662

[1000209 rows x 10 columns]